import Link from "next/link"
import Quastion from "./Quation"

const questions = [
    {id:1, question:"ما هي منصة شفاء؟", answer:"شفاء هي منصة رقمية عبر الويب تساعد المستخدمين في العثور على الأدوية المتوفرة في الصيدليات القريبة والتواصل المباشر مع الصيادلة. تهدف المنصة إلى تحسين الوصول إلى الأدوية، خاصة في المناطق التي يصعب فيها التأكد من توفر الدواء."},
    {id:2, question:"كيف تعرف منصة شفاء إذا كان الدواء متوفراً؟" , answer:"تقوم الصيدليات بتحديث مخزونها من خلال المنصة، مما يسمح بعرض توفر الأدوية في الوقت الفعلي. يساعد هذا المستخدمين على التحقق من وجود الدواء قبل زيارة الصيدلية."},
    {id:3, question:"هل يمكنني البحث عن الأدوية القريبة من موقعي؟" , answer:"نعم، تتيح المنصة للمستخدمين البحث عن الأدوية بناءً على التوفر والموقع الجغرافي، مما يساعدهم في العثور على أقرب صيدلية توفر الدواء المطلوب."},
    {id:4, question:"ماذا لو لم يكن الدواء الذي أحتاجه متوفراً؟" , answer:"يمكنك إرسال طلب عبر المنصة، ويمكن للصيدليات الرد عند توفر الدواء أو اقتراح بدائل له."},
    {id:5, question:"هل أحتاج إلى إنشاء حساب لاستخدام منصة شفاء؟" , answer:"قد تتوفر ميزات البحث الأساسية دون تسجيل، ولكن إنشاء حساب يتيح لك إرسال الطلبات، وتلقي التنبيهات، والتواصل مع الصيدليات."},
    {id:6, question:"هل المعلومات المتعلقة بتوفر الأدوية دقيقة دائماً؟" , answer:"الصيدليات مسؤولة عن تحديث مخزونها بانتظام. وبينما تهدف المنصة إلى توفير معلومات فورية، قد تحدث تأخيرات عرضية اعتماداً على سرعة التحديثات."},
    {id:7, question:"هل يمكن للصيدليات إدارة مخزونها بسهولة؟" , answer:"نعم، توفر شفاء واجهة بسيطة للصيدليات لتحديث مخزون الأدوية، وإدارة الطلبات، والتواصل مع المرضى بكفاءة."},
    {id:8, question:"هل معلوماتي الشخصية آمنة على المنصة؟" , answer:"نعم، يستخدم النظام إجراءات توثيق آمنة وحماية للبيانات للحفاظ على سلامة معلومات المستخدمين."},
    {id:9, question:"هل يمكنني تلقي تنبيهات عند توفر الدواء؟", answer:"نعم، يمكن للمستخدمين تلقي إشعارات عند إعادة توفر الأدوية المطلوبة أو عندما ترد الصيدليات على طلباتهم."},
    {id:10, question:"من المستفيد من استخدام منصة شفاء؟", answer:"يستفيد كل من المرضى والصيادلة؛ حيث يمكن للمرضى العثور على الأدوية بشكل أسرع، بينما يمكن للصيدليات إدارة المخزون بشكل أفضل والتواصل المباشر مع العملاء."},
]
export default function FAQ (){
    return(
        <div dir="rtl" className="w-full flex flex-col gap-4 items-center">
            {questions.map((qua) => <Quastion key={qua.id} question={qua}/>)}

            <p className="text-inpt text-black-500">
                إذا كان لديكم المزيد من الاستفسارات، 
                <Link href={"/#contact"} className="underline text-black-600 cursor-pointer">يرجى التواصل معنا.</Link>
            </p>
        </div>
    )
}